## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
list1=[2,3.44,0,True,'Abc',"Dhawal",1,90,100,'a']

In [4]:
pd.Series(list1)

0         2
1      3.44
2         0
3      True
4       Abc
5    Dhawal
6         1
7        90
8       100
9         a
dtype: object

## Q3. Create a Pandas DataFrame that contains the following data:

## Then, print the DataFrame.

In [10]:
dict1={'Name':('Alice','Bob','Claire'),'Age':(25,30,27),'Gender':('Female','Male',"Female")}

In [11]:
pd.DataFrame(dict1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### DataFrame is a two-dimensional tabular data consisting of multiple rows and multiple columns. While series is a one-dimensional ndarray.

In [12]:
pd.DataFrame(dict1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
type(pd.DataFrame(dict1))

pandas.core.frame.DataFrame

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

### read the dataframe by using head() function
### Counting the rows and columns in DataFrame using shape().
### Dropping the missing values in DataFrame, using dropna() 
### Merging DataFrames using merge()
### Renaming the columns of dataframe using rename()
### Sorting the DataFrame using sort_values() method.
### .loc is label base & .iloc is integer position based methods used for slicing & indexing of data.

In [14]:
df=pd.DataFrame(dict1)

In [16]:
df.shape

(3, 3)

In [19]:
df.rename(columns={'Name':"profile",'Age':'How_old'})

  profile  How_old  Gender
0   Alice       25  Female
1     Bob       30    Male
2  Claire       27  Female

In [22]:
df.sort_values(by='Age')

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

### All of the three are value mutable but series is not size mutable.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [25]:
Seri1=pd.Series([1,2,3,4,5])

In [26]:
Seri2=pd.Series(["a","b","c","d","e"])

In [30]:
df=pd.DataFrame({'S.no':Seri1,'Variable':Seri2})

In [31]:
df

   S.no Variable
0     1        a
1     2        b
2     3        c
3     4        d
4     5        e